[
  {
    "Beta": true,
    "Version": "0.3.1",
    "Date": "2024-08-28",
    "ChangeGroups": [
      {
        "Name": "Lane Changes",
        "Changes": [
          "Added smaller sidewalk sizes to the Sidewalk lane. Those are experimental and might not look perfect for now.",
          "Added the Sound Barrier lane to the edge lane group to allow placing it on the edge of the road.",
          "Fixed parked cars not touching the asphalt on the Parking lane."
        ]
      },
      {
        "Name": "Experimental Custom Lane Support",
        "Changes": [
          "Added basic support for custom lanes from PDX Mods.",
          "Use those lanes with caution.",
          "Loading the game with 'missing' custom lanes will not break your created roads, it will however generate the road as if those lanes are not part of the road."
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "Added an automatic prompt while loading into a savegame with grey roads to automatically replace them and save the city.",
          "Updated the 'Edge Lane' icon and added a tooltip for it.",
          "Added a warning icon on lanes in the list which are unrestricted by the respective advanced option.",
          "Dragging a lane now pauses the road update for a smoother editing experience.",
          "Fixed bridge and tunnel pieces not facing the right direction when there's no edge lane present.",
          "Fixed not being able to change the road category.",
          "Updated lane width options to match metric values while using US Customary units."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.3.0.1",
    "Date": "2024-08-25",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Reverted empty lanes' extra width which caused smaller empty lanes to distort sidewalks."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.3.0",
    "Date": "2024-08-25",
    "ChangeGroups": [
      {
        "Name": "New Parking Lanes",
        "Changes": [
          "Added parallel parking lane with markings (3m) and without markings (2m).",
          "Added diagonal parking lanes with and without markings (5m).",
          "Added perpendicular parking lanes with and without markings (5m)."
        ]
      },
      {
        "Name": "Sidewalk and Shoulder Changes",
        "Changes": [
          "Sidewalk and Shoulder, referred to as 'Edge Lanes', are now required to be on the edges of your roads.",
          "Edge lanes are marked with a special icon in the lane list.",
          "Placing an edge lane anywhere other than the edge will automatically move it to the closest available slot.",
          "Added a warning icon when a side is missing an edge lane.",
          "Removed the Raised Sidewalks option to make room for smarter edge lanes. This means that you can now add sidewalks everywhere.",
          "Added experimental versions of sidewalk lanes with smaller sizes, accessed by removing safety measures."
        ]
      },
      {
        "Name": "Locked Roads Changes",
        "Changes": [
          "Removed the ability to edit roads that are locked.",
          "Roads generated by Road Builder now follow their category's lock requirements."
        ]
      },
      {
        "Name": "New Advanced Settings",
        "Changes": [
          "Removed the 'Advanced User Mode' to make room for more specific options.",
          "Added 'Remove Lock Restrictions' to disable the locked roads changes.",
          "Added 'Remove Lane Restrictions' to allow you to use any lane in any road type.",
          "Added 'Remove Safety Measures' to disable the restrictions for edge lanes.",
          "Added 'Remove automatic sides on tunnels and bridges' to allow you to create roads without tunnel or bridge sides by removing edge lanes."
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "Added a delay before changes to the road are reflected in-game. Allowing you to make multiple edits faster without your game stuttering.",
          "Added new Pole lanes, similar to the empty lanes, but with the Tram and Train poles.",
          "Added more width options for empty lanes that do not match the road's ground type.",
          "Added a potential fix for roads becoming grey.",
          "Added a new hotkey to start placing the road that you are currently editing. Added a button to the edit screen that does the same thing.",
          "Using Imperial measurements in the game's settings now shows the widths of the lanes and road in feet. This also shows the speed limit in mph."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.2.2.1",
    "Date": "2024-08-19",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed deleting road configurations sometimes not updating the node properly."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.2.2",
    "Date": "2024-08-19",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Fixes for deleting a road configuration not properly removing it from the map.",
          "Fixed Empty Lanes not having all width options for european users.",
          "Added Translations."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.2.1",
    "Date": "2024-08-18",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added a Car Only / Shared Tram option to car lanes on the pedestrian roads.",
          "Changed the Tram lane on pedestrian roads' ground texture from Asphalt to Tiled.",
          "Added lane-specific ground textures to the UI. For example, adding a train empty lane to asphalt roads will show the correct gravel texture of the empty lane in the Road Builder UI.",
          "Added a flag for some lane options to not let them get copied when placing a similar lane to the road."
        ]
      },
      {
        "Name": "Fixes",
        "Changes": [
          "Fixed pillars not being deletable with Better Bulldozer.",
          "Fixed pillars and outside connection arrows not having the correct rotation [Potentially].",
          "Fixed empty lanes not having elevated and tunnel meshes."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.2.0",
    "Date": "2024-08-17",
    "ChangeGroups": [
      {
        "Name": "New Empty Lanes",
        "Changes": [
          "Added empty lanes with granular widths going from 0.5m to 4m.",
          "Empty lanes for now only have custom widths when used on their own ground type (asphalt on asphalt, gravel on gravel, etc.).",
          "Shoulders are to be used on the edges of the road, Empty lanes can be used anywhere."
        ]
      },
      {
        "Name": "Pedestrian Streets Changes",
        "Changes": [
          "Removed the 2m that was getting added to the center of pedestrian roads.",
          "Fixed tiled medians curving on nodes.",
          "Fixed inconsistency with the median and pedestrian lanes in pedestrian roads.",
          "Fixed incorrect flags being set to pedestrian roads."
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "Added new thumbnails for Shoulder lanes.",
          "Split up the electricity wires addons. Now you can completely remove electricity from a road in addition to existing options.",
          "Standardised electricity flags. This should fix roads losing electricity wires.",
          "Fixed 'Copy Lane' not working correctly in Left-Hand Traffic mode.",
          "Improved the lane list UI to have less overlap between the text and icon."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.1.2",
    "Date": "2024-08-14",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Fixed lanes being inverted when creating a new road in Left-Hand Traffic mode.",
          "Added new tooltips to UI elements that had none.",
          "Fixed and Improved tooltips for lane options.",
          "Added support for localization for future updates."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.1.1.1",
    "Date": "2024-08-13",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed track networks not using the selected speed limit."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.1.1",
    "Date": "2024-08-12",
    "ChangeGroups": [
      {
        "Name": "Left-Hand Traffic Changes",
        "Changes": [
          "Fixed the invert mode of networks created with Road Builder. This also fixes the bug related to the Traffic mod. This change however will make your created configurations under LHT reverse, your saves will be unaffected but you might have to flip networks to get them to be the same again.",
          "Thumbnails are now updated when loading into a LHT city to reflect the proper way that the network faces."
        ]
      }
    ]
  },
  {
    "Beta": true,
    "Version": "0.1.0",
    "Date": "2024-08-09",
    "ChangeGroups": [
      {
        "Name": "Release",
        "Changes": [
        ]
      }
    ]
  }
]